/*
 * @Author: Lisa 
 * @Date: 2018-12-20 14:17:32 
 * @Last Modified by: Lisa
 * @Last Modified time: 2018-12-31 19:15:43
 */
/**
 * type: user - 由于用户操作不合法造成的错误，且需要在页面对应位置给用户提示信息
 *       system - 由于网络，服务器等系统原因造成的错误，以弹框形式或其他形式对用户提示，设置几秒钟自动消失，允许用户重试
 */
const errMsgConfig = {
    
    "default" : {
        type: "system",
        message: "服务器异常，请稍后重试。"
    },
    "10008" : {
        type: "user",
        message: "手机号码不能为空"
    },
    "10010" : {
        type: "user",
        message: "验证码已发送"
    },
    "10011" : {
        type: "user",
        message: "验证码不存在或已经过期"
    },
    "10012" : {
        type: "user",
        message: "输入的验证码不匹配"
    },
    "90002" : {
        type: "user",
        message: "手机号码输入不合法"
    },
    //以下error在目前的版本中不涉及
    "10000" : "用户已经存在，注册过程中发生",
    "10001"	: "手机号不能为空，在注册，登录，获取验证码过程中发生",
    "10002"	: "密码不能为空，注册和登录过程中发生",
    "10003"	: "ticket不能为空，在注册过程中发生",
    "10004"	: "头像不能为空，在注册过程中发生",
    "10005"	: "性别不能为空，暂时未使用",
    "10006"	: "昵称不能为空，暂时未使用",
    "10007"	: "用户名不能为空，暂时未使用",
    "10009"	: "设备信息不能为空",
    "10013"	: "ticket已经过期或不存在",
    "10014"	: "提供的ticket不匹配",
};

export default errMsgConfig;